Revit 2027 API
UIDocument Constructor
 Use a database level Document to construct a UI-level Document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UIDocument(
	Document document
)
Public Sub New (
	document As Document
)
public:
UIDocument(
	Document^ document
)
new :
        document : Document -> UIDocument
Parameters
document Document
 The database level document.
Exceptions
Exception | Condition
ArgumentException |  document is not a primary document, it is a linked document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace